import folium

# Создаем карту Москвы
m = folium.Map(location=[55.7558, 37.6173], zoom_start=13)

# Данные округов: название, ID, список (lat, lon, radius)
districts = {
    "Басманный": {
        "id": 6,
        "points": [(55.759942, 37.644450, 850)],
        "color": "red"
    },
    "Арбат": {
        "id": 6,
        "points": [(55.752369, 37.602139, 300),
                   (55.751452, 37.590228,580)],
        "color": "darkred"
    },
    "Замоскворечье": {
        "id": 7,
        "points": [(55.742787, 37.632529, 600),
                   (55.732357, 37.635521, 700),
                   (55.739047, 37.640982,200)],
        "color": "blue"
    },
    "Красносельский": {
        "id": 8,
        "points": [(55.763417, 37.632583, 250),
                   (55.768415, 37.636491, 380),
                   (55.759431, 37.628882,180)],
        "color": "green"
    },
    "Мещанский": {
        "id": 9,
        "points": [(55.762809, 37.624040, 350),
                   (55.769965, 37.626798, 460)],
        "color": "purple"
    },
    "Пресненский": {
        "id": 10,
        "points": [(55.759856, 37.596112, 600),
                   (55.756356, 37.604942,240),
                   (55.766248, 37.595384,170)],
        "color": "orange"
    },
    "Таганский": {
        "id": 11,
        "points": [(55.750910, 37.638252, 370),
                   (55.747317, 37.647477, 490),
                   (55.741951, 37.649912,250)],
        "color": "darkorange"
    },
    "Тверской": {
        "id": 5,
        "points": [(55.753673, 37.619881, 790),
                   (55.762541, 37.612308, 500),
                   (55.770314, 37.607332, 700),
                   (55.766157, 37.617797,190)],
        "color": "darkblue"
    },
    "Хамовники": {
        "id": 12,
        "points": [(55.746421, 37.604169, 400),
                   (55.742048, 37.595123, 630)],
        "color": "darkgreen"
    },
    "Якиманка": {
        "id": 13,
        "points": [(55.742975, 37.617662, 670),
                   (55.735778, 37.614347, 640)],
        "color": "cadetblue"
    }
}

# Рисуем круги
for district, data in districts.items():
    for lat, lon, radius in data["points"]:
        folium.Circle(
            location=(lat, lon),
            radius=radius,
            color=data["color"],
            fill=True,
            fill_opacity=0.4,
            popup=f"{district} (ID: {data['id']})"
        ).add_to(m)

# Сохраняем карту в HTML
m.save("moscow_districts.html")
